REGULAR/Cmesh/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          50;
        startFace       9800;
    }
    outlet
    {
        type            patch;
        nFaces          100;
        startFace       9850;
    }
    bottom
    {
        type            slip;
        inGroups        List<word> 1(slip);
        nFaces          75;
        startFace       9950;
    }
    top
    {
        type            slip;
        inGroups        List<word> 1(slip);
        nFaces          75;
        startFace       10025;
    }
    obstacle
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          100;
        startFace       10100;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          10000;
        startFace       10200;
    }
)

// ************************************************************************* //
